<a href="https://colab.research.google.com/github/Savvy-Slowley/Police-Misconduct/blob/main/Police_Misconduct.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Import

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
# SQL
from sqlalchemy import create_engine

# New York City Data Cleaning

In [2]:
nyc = pd.read_csv('/content/New York Police Misconduct Settlements.csv')
nyc.head()

   plaintiff_name  claim_number  ... matter_name case_outcome
0     Kathy Batka  2009PI023313  ...         NaN          NaN
1   Ingrid Conway  2009PI014930  ...         NaN          NaN
2  Melvin Rennock  2009PI000487  ...         NaN          NaN
3  Peter Mcenaney  2008PI024680  ...         NaN          NaN
4   Hector Galvez  2008PI022264  ...         NaN          NaN

[5 rows x 21 columns]

In [3]:
nyc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32632 entries, 0 to 32631
Data columns (total 21 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   plaintiff_name       32632 non-null  object
 1   claim_number         32632 non-null  object
 2   summary_allegations  32632 non-null  object
 3   incident_date        32197 non-null  object
 4   filed_date           32632 non-null  object
 5   plaintiff_attorney   31647 non-null  object
 6   closed_date          32632 non-null  object
 7   amount_awarded       32632 non-null  float64
 8   location             32632 non-null  object
 9   calendar_year        32632 non-null  int64
 10  incident_year        32197 non-null  float64
 11  filed_year           32632 non-null  int64
 12  city                 32632 non-null  object
 13  state                32632 non-null  object
 14  other_expenses       0 non-null      float64
 15  collection           0 non-null      float64
 16  total_incurred       0 non-null      float64
 17  court                0 non-null      float64
 18  docket_number        0 non-null      float64
 19  matter_name          0 non-null      float64
 20  case_outcome         0 non-null      float64
dtypes: float64(9), int64(2), object(10)
memory usage: 5.2+ MB

In [4]:
nyc.isnull().sum()

plaintiff_name             0
claim_number               0
summary_allegations        0
incident_date            435
filed_date                 0
plaintiff_attorney       985
closed_date                0
amount_awarded             0
location                   0
calendar_year              0
incident_year            435
filed_year                 0
city                       0
state                      0
other_expenses         32632
collection             32632
total_incurred         32632
court                  32632
docket_number          32632
matter_name            32632
case_outcome           32632
dtype: int64

In [5]:
nyc.duplicated().any()

False

In [6]:
nyc.drop(columns= ['other_expenses', 'collection', 'total_incurred', 'court', 'docket_number','matter_name', 'case_outcome'], 
        inplace = True,
        axis = 1)

In [7]:
nyc.isnull().sum()

plaintiff_name           0
claim_number             0
summary_allegations      0
incident_date          435
filed_date               0
plaintiff_attorney     985
closed_date              0
amount_awarded           0
location                 0
calendar_year            0
incident_year          435
filed_year               0
city                     0
state                    0
dtype: int64

5% rule

In [8]:
nyc.dropna(inplace=True)

In [9]:
nyc.describe()

       amount_awarded  calendar_year  incident_year    filed_year
count    3.127100e+04   31271.000000   31271.000000  31271.000000
mean     5.082343e+04    2014.497234    2012.073039   2012.644623
std      3.607730e+05       2.713653       3.309864      3.090965
min      1.000000e+00    2010.000000    1980.000000   2000.000000
25%      9.000000e+03    2012.000000    2010.000000   2011.000000
50%      1.750000e+04    2014.000000    2012.000000   2013.000000
75%      3.000000e+04    2017.000000    2014.000000   2015.000000
max      1.517500e+07    2019.000000    2019.000000   2019.000000

In [10]:
nyc.loc[nyc['amount_awarded'] == 1, :].head(10)

             plaintiff_name  claim_number  ...           city state
14367           Susan Crane  2014PI008992  ...  New York City    NY
14515        Sandra Adragna  2014PI013874  ...  New York City    NY
14601        Eleen Frabncis  2014PI000064  ...  New York City    NY
14603       Shauna Frabncis  2014PI000065  ...  New York City    NY
19165       Franclot Graham  2013PI013387  ...  New York City    NY
30567  Thomas Girbes Pierce  2017PI020570  ...  New York City    NY
30876        Vernail Blount  2015PI032182  ...  New York City    NY

[7 rows x 14 columns]

# Philadelphia Data Cleaning

In [11]:
phl = pd.read_csv('/content/Philly Police Misconduct Settlements.csv')
phl.tail()

      calendar_year  ... summary_allegations
1419         2009.0  ...                 NaN
1420         2009.0  ...                 NaN
1421         2009.0  ...                 NaN
1422         2009.0  ...                 NaN
1423         2009.0  ...                 NaN

[5 rows x 21 columns]

In [12]:
phl.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1424 entries, 0 to 1423
Data columns (total 21 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   calendar_year        1423 non-null   float64
 1   city                 1424 non-null   object
 2   state                1424 non-null   object
 3   incident_date        1400 non-null   object
 4   incident_year        1400 non-null   float64
 5   filed_date           0 non-null      float64
 6   filed_year           0 non-null      float64
 7   closed_date          1423 non-null   object
 8   amount_awarded       1424 non-null   float64
 9   other_expenses       0 non-null      float64
 10  collection           0 non-null      float64
 11  total_incurred       0 non-null      float64
 12  case_outcome         0 non-null      float64
 13  docket_number        1414 non-null   object
 14  claim_number         0 non-null      float64
 15  court                0 non-null      float64
 16  plaintiff_name       1424 non-null   object
 17  plaintiff_attorney   0 non-null      float64
 18  matter_name          0 non-null      float64
 19  location             1320 non-null   object
 20  summary_allegations  0 non-null      float64
dtypes: float64(14), object(7)
memory usage: 233.8+ KB

In [13]:
phl.isnull().sum()

calendar_year             1
city                      0
state                     0
incident_date            24
incident_year            24
filed_date             1424
filed_year             1424
closed_date               1
amount_awarded            0
other_expenses         1424
collection             1424
total_incurred         1424
case_outcome           1424
docket_number            10
claim_number           1424
court                  1424
plaintiff_name            0
plaintiff_attorney     1424
matter_name            1424
location                104
summary_allegations    1424
dtype: int64

In [14]:
phl.duplicated().any()

False

In [15]:
phl.drop(inplace=True,axis=1,columns=['summary_allegations','matter_name','plaintiff_attorney','court','claim_number',
                                      'case_outcome','total_incurred','collection','other_expenses','filed_year'
                                      ,'filed_date'])

In [16]:
phl.isnull().sum()

calendar_year       1
city                0
state               0
incident_date      24
incident_year      24
closed_date         1
amount_awarded      0
docket_number      10
plaintiff_name      0
location          104
dtype: int64

In [17]:
phl[['location']] = phl[['location']].fillna(value='Unknown')

In [18]:
phl.dropna(inplace=True)

In [19]:
phl.describe()

       calendar_year  incident_year  amount_awarded
count    1392.000000    1392.000000    1.392000e+03
mean     2013.991379    2010.320402    8.142661e+04
std         3.130506       3.207771    3.622573e+05
min      2009.000000    1988.000000    1.000000e+02
25%      2011.000000    2008.000000    1.250000e+04
50%      2014.000000    2010.000000    2.500000e+04
75%      2017.000000    2012.000000    5.500000e+04
max      2019.000000    2018.000000    9.850000e+06

In [20]:
phl.loc[phl['location'] == 'Unknown', :].head()

    calendar_year          city state  ... docket_number     plaintiff_name location
17         2010.0  Philadelphia    PA  ...      685410.0  Nicholson, Derick  Unknown
43         2010.0  Philadelphia    PA  ...        08-769        Dade, Leroy  Unknown
49         2010.0  Philadelphia    PA  ...      747135.0        Banks, Ryan  Unknown
56         2010.0  Philadelphia    PA  ...      764271.0       Evans, James  Unknown
60         2010.0  Philadelphia    PA  ...      607278.0    Friel, Lawrence  Unknown

[5 rows x 10 columns]

# SQL

## Creating a Database and SQL Table

In [21]:
# create sqlite engine
engine = create_engine('sqlite:///Police Misconduct.db', echo=True)
# create connection to engine
conn = engine.connect()

In [22]:
# add the dataframe as a table in sqlite for New York City
sqlite_table = "New_York"
nyc.to_sql(sqlite_table, conn, if_exists='fail')

# add the dataframe as a table in sqlite for Philadelphia
sqlite_table2 = "Philly"
phl.to_sql(sqlite_table2, conn, if_exists='fail')

2021-12-02 04:32:47,148 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("New_York")
2021-12-02 04:32:47,149 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-12-02 04:32:47,152 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("New_York")
2021-12-02 04:32:47,154 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-12-02 04:32:47,166 INFO sqlalchemy.engine.Engine
CREATE TABLE "New_York" (
	"index" BIGINT,
	plaintiff_name TEXT,
	claim_number TEXT,
	summary_allegations TEXT,
	incident_date TEXT,
	filed_date TEXT,
	plaintiff_attorney TEXT,
	closed_date TEXT,
	amount_awarded FLOAT,
	location TEXT,
	calendar_year BIGINT,
	incident_year FLOAT,
	filed_year BIGINT,
	city TEXT,
	state TEXT
)


2021-12-02 04:32:47,169 INFO sqlalchemy.engine.Engine [no key 0.00216s] ()
2021-12-02 04:32:47,191 INFO sqlalchemy.engine.Engine COMMIT
2021-12-02 04:32:47,194 INFO sqlalchemy.engine.Engine CREATE INDEX "ix_New_York_index" ON "New_York" ("index")
2021-12-02 04:32:47,195 INFO sqlalchemy.engine.Engine [no key 0.00120s] ()
2021-12-02 04:32:47,208 INFO sqlalchemy.engine.Engine COMMIT
2021-12-02 04:32:47,253 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2021-12-02 04:32:48,480 INFO sqlalchemy.engine.Engine INSERT INTO "New_York" ("index", plaintiff_name, claim_number, summary_allegations, incident_date, filed_date, plaintiff_attorney, closed_date, amount_awarded, location, calendar_year, incident_year, filed_year, city, state) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
2021-12-02 04:32:48,482 INFO sqlalchemy.engine.Engine [generated in 1.15338s] ((0, 'Kathy Batka', '2009PI023313', 'CIVIL RIGHTS CLAIMS', '2008-07-26', '2009-08-24', 'Matthew Flamm', '2010-01-04 00:00:00', 5000.0, '7 AV & 33 ST & 34 ST, MANHATTAN (NEW YORK)', 2010, 2008.0, 2009, 'New York City', 'NY'), (1, 'Ingrid Conway', '2009PI014930', 'PEACE OFFICER/POLICE ACTION (PI)', '2009-05-01', '2009-06-12', 'Richard J Cardinale', '2010-01-04 00:00:00', 15000.0, '111 BRIDGE ST, BROOKLYN (KINGS)', 2010, 2009.0, 2009, 'New York City', 'NY'), (2, 'Melvin Rennock', '2009PI000487', 'CIVIL RIGHTS CLAIMS', '2005-09-05', '2008-11-06', 'Anthony C Ofodile', '2010-01-04 00:00:00', 17500.0, 'Precise location missing, BROOKLYN (KINGS)', 2010, 2005.0, 2008, 'New York City', 'NY'), (3, 'Peter Mcenaney', '2008PI024680', 'CIVIL RIGHTS CLAIMS', '2007-12-31', '2008-09-18', 'Richard Cardinale', '2010-01-04 00:00:00', 11000.0, 'Precise location missing, BROOKLYN (KINGS)', 2010, 2007.0, 2008, 'New York City', 'NY'), (4, 'Hector Galvez', '2008PI022264', 'PEACE OFFICER/POLICE ACTION (PI)', '2008-08-23', '2008-09-18', 'Rosenberg Minc Falkoff & Wolff', '2010-01-04 00:00:00', 25000.0, '444 E 119 ST, MANHATTAN (NEW YORK)', 2010, 2008.0, 2008, 'New York City', 'NY'), (5, 'Dwight Trotman', '2008PI007921', 'PEACE OFFICER/POLICE ACTION (PI)', '2008-01-03', '2008-03-17', 'Breadbar Garfield', '2010-01-04 00:00:00', 5000.0, '1262 WEBSTER AV, BRONX', 2010, 2008.0, 2008, 'New York City', 'NY'), (6, 'Marlon Moville', '2003PI029883', 'PEACE OFFICER/POLICE ACTION (PI)', '2003-11-09', '2003-11-09', 'Rubenstein & Rynecki', '2010-01-04 00:00:00', 25000.0, 'FLATBUSH AV & PARKSIDE AV, BROOKLYN (KINGS)', 2010, 2003.0, 2003, 'New York City', 'NY'), (7, 'Sun Saijin', '2010PI001993', 'PEACE OFFICER/POLICE ACTION (PI)', '2009-10-08', '2009-12-02', 'Salzman & Winer Llp', '2010-01-05 00:00:00', 7500.0, '251 39 ST, MANHATTAN (NEW YORK)', 2010, 2009.0, 2009, 'New York City', 'NY')  ... displaying 10 of 31271 total bound parameter sets ...  (32630, 'Rashawn Marquez', '2018PI021001', 'PEACE OFFICER/POLICE ACTION (PI)', '2018-04-30', '2018-07-13', 'Brownstein Legal', '2019-12-31 00:00:00', 3000.0, '22 PLEASANT PL, BROOKLYN (KINGS), NY', 2019, 2018.0, 2018, 'New York City', 'NY'), (32631, 'Marquella Martin', '2018PI020155', 'PEACE OFFICER/POLICE ACTION (PI)', '2018-06-26', '2018-07-06', 'Brownstein Legal', '2019-12-31 00:00:00', 3500.0, 'ROCKAWAY AVE ATLANTIC AVE, BROOKLYN (KINGS), NY', 2019, 2018.0, 2018, 'New York City', 'NY'))
2021-12-02 04:32:48,673 INFO sqlalchemy.engine.Engine COMMIT
2021-12-02 04:32:48,732 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2021-12-02 04:32:48,734 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-12-02 04:32:48,740 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("Philly")
2021-12-02 04:32:48,746 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-12-02 04:32:48,749 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("Philly")
2021-12-02 04:32:48,752 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-12-02 04:32:48,759 INFO sqlalchemy.engine.Engine
CREATE TABLE "Philly" (
	"index" BIGINT,
	calendar_year FLOAT,
	city TEXT,
	state TEXT,
	incident_date TEXT,
	incident_year FLOAT,
	closed_date TEXT,
	amount_awarded FLOAT,
	docket_number TEXT,
	plaintiff_name TEXT,
	location TEXT
)


2021-12-02 04:32:48,760 INFO sqlalchemy.engine.Engine [no key 0.00152s] ()
2021-12-02 04:32:48,779 INFO sqlalchemy.engine.Engine COMMIT
2021-12-02 04:32:48,781 INFO sqlalchemy.engine.Engine CREATE INDEX "ix_Philly_index" ON "Philly" ("index")
2021-12-02 04:32:48,785 INFO sqlalchemy.engine.Engine [no key 0.00323s] ()
2021-12-02 04:32:48,799 INFO sqlalchemy.engine.Engine COMMIT
2021-12-02 04:32:48,803 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2021-12-02 04:32:48,845 INFO sqlalchemy.engine.Engine INSERT INTO "Philly" ("index", calendar_year, city, state, incident_date, incident_year, closed_date, amount_awarded, docket_number, plaintiff_name, location) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
2021-12-02 04:32:48,847 INFO sqlalchemy.engine.Engine [generated in 0.03329s] ((0, 2010.0, 'Philadelphia', 'PA', '2004-05-25', 2004.0, '2010-01-11', 3871.0, '126892.0', 'Pendergrass, Antonio', '6000  Chester Avenue'), (1, 2010.0, 'Philadelphia', 'PA', '2005-07-28', 2005.0, '2010-01-12', 45000.0, '25750.0', 'Mann, John', 'CJC'), (2, 2010.0, 'Philadelphia', 'PA', '2008-07-03', 2008.0, '2010-01-21', 25000.0, '196016.0', 'Drummond, Geovani', '61 West Logan Street'), (3, 2010.0, 'Philadelphia', 'PA', '2005-04-25', 2005.0, '2010-01-26', 750.0, '3081367.0', 'Velez, Ramon', '2nd St. & Lehigh Ave.'), (4, 2010.0, 'Philadelphia', 'PA', '2007-05-05', 2007.0, '2010-01-27', 12500.0, '4091056.0', 'Malaszecki, Brian', '4415  Decatur Street'), (5, 2010.0, 'Philadelphia', 'PA', '2009-02-09', 2009.0, '2010-01-28', 30000.0, '358184.0', 'Hamilin, Candice', 'Cheltenham Ave. towards Rising Sun Ave.'), (6, 2010.0, 'Philadelphia', 'PA', '2006-08-03', 2006.0, '2010-02-01', 1500.0, '8083228.0', 'DiGiacomo, Joseph', '381 Livesey Street'), (7, 2010.0, 'Philadelphia', 'PA', '2007-08-04', 2007.0, '2010-02-03', 275000.0, '893597.0', 'Lally, Timothy', 'One Noble St.')  ... displaying 10 of 1392 total bound parameter sets ...  (1422, 2009.0, 'Philadelphia', 'PA', '2007-07-07', 2007.0, '2009-12-31', 4400.0, '709306.0', 'Peo, Stephen', '7201 Roosevelt Blvd'), (1423, 2009.0, 'Philadelphia', 'PA', '2007-10-27', 2007.0, '2009-12-31', 19500.0, '2093627.0', 'Masri, Rabih', 'Methodist Hospital Emergency Room'))
2021-12-02 04:32:48,857 INFO sqlalchemy.engine.Engine COMMIT
2021-12-02 04:32:48,874 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2021-12-02 04:32:48,876 INFO sqlalchemy.engine.Engine [raw sql] ()

## Queries

### Who are the plaintiff attornies without duplication and in alphabetical order had a case between January 1st, 2009 and December 31st, 2011?

In [24]:
# My SQL query
sql = """
SELECT DISTINCT(plaintiff_attorney), plaintiff_name, amount_awarded, incident_date
FROM New_York 
WHERE incident_date BETWEEN '2009-01-01' AND '2011-12-31'
ORDER BY plaintiff_attorney 
LIMIT 5
"""

# Read the sql query into pandas to view the results
df = pd.read_sql_query(sql, engine)
df.head()

2021-12-02 04:32:48,903 INFO sqlalchemy.engine.Engine
SELECT DISTINCT(plaintiff_attorney), plaintiff_name, amount_awarded, incident_date
FROM New_York
WHERE incident_date BETWEEN '2009-01-01' AND '2011-12-31'
ORDER BY plaintiff_attorney
LIMIT 5

2021-12-02 04:32:48,906 INFO sqlalchemy.engine.Engine [raw sql] ()

                   plaintiff_attorney  ... incident_date
0  325 Broadway Gannes And Musico Llp  ...    2009-09-14
1                       A. James Bell  ...    2011-04-14
2                   Aaron Wallenstein  ...    2010-10-21
3                   Aaron Wallenstein  ...    2010-10-21
4                   Aaron Wallenstein  ...    2010-07-20

[5 rows x 4 columns]

### Who is the highest awarded plaintiff?

In [25]:
# My SQL query
sql = """
SELECT MAX(amount_awarded), plaintiff_name, incident_date, incident_year, closed_date
FROM New_York 
"""

# Read the sql query into pandas to view the results
df = pd.read_sql_query(sql, engine)
df.head()

2021-12-02 04:32:48,955 INFO sqlalchemy.engine.Engine
SELECT MAX(amount_awarded), plaintiff_name, incident_date, incident_year, closed_date
FROM New_York

2021-12-02 04:32:48,959 INFO sqlalchemy.engine.Engine [raw sql] ()

   MAX(amount_awarded)     plaintiff_name  ... incident_year          closed_date
0           15175000.0  Paul Et Al Casale  ...        2007.0  2011-12-16 00:00:00

[1 rows x 5 columns]

### What is the most frequent award amount that the plaintiff receives?

In [36]:
# My SQL query
sql = """
SELECT amount_awarded, COUNT(amount_awarded) AS plaintiff_with_same_amount_awarded
FROM New_York
WHERE amount_awarded >= 10000 
GROUP BY amount_awarded
ORDER BY plaintiff_with_same_amount_awarded DESC
LIMIT 5
"""

# Read the sql query into pandas to view the results
df = pd.read_sql_query(sql, engine)
df.head()

2021-12-02 04:38:57,878 INFO sqlalchemy.engine.Engine
SELECT amount_awarded, COUNT(amount_awarded) AS plaintiff_with_same_amount_awarded
FROM New_York
WHERE amount_awarded >= 10000
GROUP BY amount_awarded
ORDER BY plaintiff_with_same_amount_awarded DESC
LIMIT 5

2021-12-02 04:38:57,882 INFO sqlalchemy.engine.Engine [raw sql] ()

   amount_awarded  plaintiff_with_same_amount_awarded
0         15000.0                                2597
1         20000.0                                2098
2         10000.0                                1958
3         25000.0                                1936
4         12500.0                                1394

### Which type of allegations have the highest average award amount?

In [49]:
# My SQL query
sql = """
SELECT summary_allegations, ROUND(AVG(amount_awarded),2) AS average_amount_awarded
FROM New_York 
GROUP BY summary_allegations
ORDER BY average_amount_awarded DESC
LIMIT 5
"""

# Read the sql query into pandas to view the results
df = pd.read_sql_query(sql, engine)
df.head()

2021-12-02 05:49:52,669 INFO sqlalchemy.engine.Engine
SELECT summary_allegations, ROUND(AVG(amount_awarded),2) AS average_amount_awarded
FROM New_York
GROUP BY summary_allegations
ORDER BY average_amount_awarded DESC
LIMIT 5

2021-12-02 05:49:52,671 INFO sqlalchemy.engine.Engine [raw sql] ()

                summary_allegations  average_amount_awarded
0                   PERSONAL INJURY               120000.00
1               CIVIL RIGHTS CLAIMS                67925.09
2                     MISCELLANEOUS                55600.00
3  PEACE OFFICER/POLICE ACTION (PI)                42652.23
4                            HYBRID                24750.00

### What are some famous police brutality cases?

In [50]:
# My SQL query
sql = """
SELECT *
FROM New_York 
WHERE plaintiff_name == 'Sean Bell' 
OR plaintiff_name ==  'Eric Garner'
OR plaintiff_name ==  'Akai Gurley'
LIMIT 5
"""

# Read the sql query into pandas to view the results
df = pd.read_sql_query(sql, engine)
df.head()

2021-12-02 05:50:22,588 INFO sqlalchemy.engine.Engine
SELECT *
FROM New_York
WHERE plaintiff_name == 'Sean Bell'
OR plaintiff_name ==  'Eric Garner'
OR plaintiff_name ==  'Akai Gurley'
LIMIT 5

2021-12-02 05:50:22,591 INFO sqlalchemy.engine.Engine [raw sql] ()

   index plaintiff_name  claim_number  ... filed_year           city state
0   1457      Sean Bell  2007PI024537  ...       2007  New York City    NY
1  18741    Eric Garner  2014PI030575  ...       2014  New York City    NY
2  22540    Akai Gurley  2015PI002382  ...       2015  New York City    NY

[3 rows x 15 columns]

### Who has a higher average amount awarded by calender year between NYC and Philly?

In [59]:
# My SQL query
sql = """
SELECT ny.calendar_year, AVG(ny.amount_awarded) AS NYC_average_amount_awarded, AVG(ph.amount_awarded) AS PHILLY_average_amount_awarded
FROM New_York ny 
JOIN Philly ph ON ny.calendar_year = ph.calendar_year
Group By ny.calendar_year
"""

# Read the sql query into pandas to view the results
df = pd.read_sql_query(sql, engine)
df.head()

2021-12-02 06:04:17,141 INFO sqlalchemy.engine.Engine
SELECT ny.calendar_year, AVG(ny.amount_awarded) AS NYC_average_amount_awarded, AVG(ph.amount_awarded) AS PHILLY_average_amount_awarded
FROM New_York ny
JOIN Philly ph ON ny.calendar_year = ph.calendar_year
Group By ny.calendar_year

2021-12-02 06:04:17,143 INFO sqlalchemy.engine.Engine [raw sql] ()

   calendar_year  NYC_average_amount_awarded  PHILLY_average_amount_awarded
0           2010                48811.706026                   54801.430894
1           2011                34086.819360                   71993.114609
2           2012                32033.229003                   54678.857933
3           2013                27571.716328                  108093.763651
4           2014                49429.956320                   90210.825833

## End SQL connection

In [60]:
# Close the database connection
conn.close()